# Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
# В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
# Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.

from sys import argv

def salary(hours, rate, bonus):
    return hours * rate + bonus

_, hours, rate, bonus = argv
print(salary(float(hours), float(rate), float(bonus)))